In [60]:
import pandas as pd
import numpy as np

In [61]:
datas = pd.date_range("20220101", periods=6)
#pega datas. Periodo. Inicio e fim. Ano, mês, dia. periods é dias a mais

In [62]:
for x in datas:
    print(x)

2022-01-01 00:00:00
2022-01-02 00:00:00
2022-01-03 00:00:00
2022-01-04 00:00:00
2022-01-05 00:00:00
2022-01-06 00:00:00

In [63]:
df = pd.DataFrame(np.random.randn(6,4))
#Gera um df. Função data frame 
#vai gerar biblioteca numpy com numeros aleatorios. 6 linhas e 4 colunas 
#gera numeros randomicos. randn é pegar numeros aleatorios respeitando distribuilçao normal com média 0 e desvio padrão 1 

df

          0         1         2         3
0 -1.060295 -0.672833 -0.306632  0.842625
1 -1.390018  0.620347  0.430174 -0.964590
2  0.901143  0.685090  0.621172 -0.317342
3 -0.544218 -0.497251  0.926693 -1.011611
4 -1.362394  0.059739 -0.375484  2.242987
5 -0.624833 -0.217100 -0.861076  2.513809

In [64]:
list("ABCD")

['A', 'B', 'C', 'D']

In [65]:
df = pd.DataFrame(np.random.randn(6,4), index = datas, columns=list("ABCD"))
#df = pd.DataFrame(np.random.randn(6,4), index = datas, columns= ["Carros", "Paises", "Pessoas", "Opa"])
#index é a referência da linhas. são 6 datas, 6 linhas. 
#colunas são uma lista das 4 letras.

#index = nome das linhas
#columns = nome das colunas
df

                   A         B         C         D
2022-01-01 -0.082417  0.591693 -0.385513 -0.217345
2022-01-02  0.754105  0.300576  0.081623 -1.220588
2022-01-03  0.742985 -1.872809  1.210059  0.287402
2022-01-04 -1.446650 -1.834204 -1.059631 -2.386505
2022-01-05 -2.613325  1.564834 -0.510600  0.918078
2022-01-06  1.429111 -1.056421 -0.436776  0.418390

In [66]:
# [] lista    print(nome_lista[3])
# () tupla    print(nome_lista[3])
# {} dicionario   dicionario = {"A": "Opa", "B": 4}



df2 = pd.DataFrame({"A": 7, 
                   "B": pd.Timestamp("20220101"), 
                   "C": pd.Series(1, index= list(range(4)), dtype="float32"), 
                   "D": np.array([3] * 4, dtype="int32"),
                   "E": pd.Categorical(["test", "train", "test", "train"]),
                   "F": "Python"})

#cada chave, ABCDEF é a coluna

df2

   A          B    C  D      E       F
0  7 2022-01-01  1.0  3   test  Python
1  7 2022-01-01  1.0  3  train  Python
2  7 2022-01-01  1.0  3   test  Python
3  7 2022-01-01  1.0  3  train  Python

# Pandas para Plotly

In [67]:
#Dicionario que recebe lista de valores
data = {'Nome' : ['Lucas', 'Rafael', 'Lais'],
       'Idade': [29,33,11],
        'Cidade': ['Salvador', 'Rio de Janeiro', 'São Paulo']
       }
#data['Nome']
df = pd.DataFrame(data, index = [1,2,3])
#df = pd.DataFrame(data, index = range(1, 4)) #Range 5 da erro pq nao tem 4 linhas. Ultimo valor é exclusivo
df

     Nome  Idade          Cidade
1   Lucas     29        Salvador
2  Rafael     33  Rio de Janeiro
3    Lais     11       São Paulo

In [68]:
df.index

Int64Index([1, 2, 3], dtype='int64')

In [69]:
df.columns.to_list()

['Nome', 'Idade', 'Cidade']

In [70]:
df.columns.values
#Criou um array.

array(['Nome', 'Idade', 'Cidade'], dtype=object)

In [71]:
df['Nome']

1     Lucas
2    Rafael
3      Lais
Name: Nome, dtype: object

In [72]:
type(df['Nome'])
#Series é estrutura do pandas que representa vetor unidimensional
#DataFrame tem 2 dimensões. Linha e coluna. Series é só um vetor

pandas.core.series.Series

In [73]:
df['Estado'] = ['BA', 'RJ', 'SP']
df

     Nome  Idade          Cidade Estado
1   Lucas     29        Salvador     BA
2  Rafael     33  Rio de Janeiro     RJ
3    Lais     11       São Paulo     SP

In [74]:
#loc  É tipo localizar

df.loc[2, 'Cidade']

'Rio de Janeiro'

In [75]:
linha = 1
coluna = 'Nome'
df.loc[linha, coluna]

'Lucas'

In [76]:
df.loc[2, :]
#linha 2 inteira

Nome              Rafael
Idade                 33
Cidade    Rio de Janeiro
Estado                RJ
Name: 2, dtype: object

In [77]:
df.loc[:, 'Nome']

1     Lucas
2    Rafael
3      Lais
Name: Nome, dtype: object

In [78]:
df.loc[1, 'Idade': 'Cidade']

Idade           29
Cidade    Salvador
Name: 1, dtype: object

In [79]:
df.loc[[1,3], ['Idade', 'Nome' ]]

   Idade   Nome
1     29  Lucas
3     11   Lais

In [80]:
df

     Nome  Idade          Cidade Estado
1   Lucas     29        Salvador     BA
2  Rafael     33  Rio de Janeiro     RJ
3    Lais     11       São Paulo     SP

In [81]:
#iloc pega elementos pela indexação
#linha tem indice 0,1 etc
#coluna tem indice 0,1 etc

In [82]:
#Pega da linha 1 até final, coluna 2 até o final
df.iloc[1:,2:,]

           Cidade Estado
2  Rio de Janeiro     RJ
3       São Paulo     SP

In [83]:
#pega do inicio até linha 1 e do inicio ate coluna 2
df.iloc[:2,:3]

     Nome  Idade          Cidade
1   Lucas     29        Salvador
2  Rafael     33  Rio de Janeiro

In [84]:
df.iloc[[0,2],[0,3]]
#linha 0 e linha 2
#coluna  e linha 3

    Nome Estado
1  Lucas     BA
3   Lais     SP

In [85]:
df['Idade'].mean()
#média das idades

24.333333333333332

In [86]:
df['Idade'].var()
#variancia das idades

137.33333333333331

In [87]:
df['Idade'].sum()

73

In [88]:
df['Idade'].describe()

count     3.000000
mean     24.333333
std      11.718931
min      11.000000
25%      20.000000
50%      29.000000
75%      31.000000
max      33.000000
Name: Idade, dtype: float64

# Continuando Pandas

In [89]:
#Colocando df. e apertando TAB aparecem os métodos.
#Este mostra que tipo de valor são as colunas
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [90]:
datas = pd.date_range('20220101', periods = 60, freq='D')
df = pd.DataFrame(np.random.randn(60,5), index = datas, columns=list('ABCDE'))
#df.shape  Ver quantidade de linhas e colunas
df.head(3)

                   A         B         C         D         E
2022-01-01 -1.913978 -1.163740 -0.315478  0.856644  0.522754
2022-01-02  0.575390  0.750426  0.010960  0.465143 -1.613065
2022-01-03  0.353306  0.650309 -0.130551 -0.692776 -0.297821

In [91]:
#adicionando uma coluna
df["F"] = 1
df.head(3)

                   A         B         C         D         E  F
2022-01-01 -1.913978 -1.163740 -0.315478  0.856644  0.522754  1
2022-01-02  0.575390  0.750426  0.010960  0.465143 -1.613065  1
2022-01-03  0.353306  0.650309 -0.130551 -0.692776 -0.297821  1

In [92]:
#df["G"] = [3,5,6,9]
#Vai dar erros pois nao tem 60 linhas.

df["G"] = range(60) #da pra criar tipo um index
df.head(3)

                   A         B         C         D         E  F  G
2022-01-01 -1.913978 -1.163740 -0.315478  0.856644  0.522754  1  0
2022-01-02  0.575390  0.750426  0.010960  0.465143 -1.613065  1  1
2022-01-03  0.353306  0.650309 -0.130551 -0.692776 -0.297821  1  2

In [93]:
df['Soma'] = df['A'] * df['B']
df.head(3)

                   A         B         C         D         E  F  G      Soma
2022-01-01 -1.913978 -1.163740 -0.315478  0.856644  0.522754  1  0  2.227371
2022-01-02  0.575390  0.750426  0.010960  0.465143 -1.613065  1  1  0.431788
2022-01-03  0.353306  0.650309 -0.130551 -0.692776 -0.297821  1  2  0.229758

In [94]:
#Modificar valores
df['C'] = 2
df.head(3)

                   A         B  C         D         E  F  G      Soma
2022-01-01 -1.913978 -1.163740  2  0.856644  0.522754  1  0  2.227371
2022-01-02  0.575390  0.750426  2  0.465143 -1.613065  1  1  0.431788
2022-01-03  0.353306  0.650309  2 -0.692776 -0.297821  1  2  0.229758

In [95]:
df2

   A          B    C  D      E       F
0  7 2022-01-01  1.0  3   test  Python
1  7 2022-01-01  1.0  3  train  Python
2  7 2022-01-01  1.0  3   test  Python
3  7 2022-01-01  1.0  3  train  Python

### Visualizando Dados

In [99]:
df2

   A          B    C  D      E       F
0  7 2022-01-01  1.0  3   test  Python
1  7 2022-01-01  1.0  3  train  Python
2  7 2022-01-01  1.0  3   test  Python
3  7 2022-01-01  1.0  3  train  Python

In [97]:
df2.head(2) #ve o cabeçalho com 2 primeiras linhas

   A          B    C  D      E       F
0  7 2022-01-01  1.0  3   test  Python
1  7 2022-01-01  1.0  3  train  Python

In [98]:
df2.tail(2) #ve o cabeçalho com 2 ultimas linhas

   A          B    C  D      E       F
2  7 2022-01-01  1.0  3   test  Python
3  7 2022-01-01  1.0  3  train  Python

In [100]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [101]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [102]:
df2.to_numpy()
#transforma df em array (matriz) numpy.
#bom para fazer metodos matematicos com os valores

array([[7, Timestamp('2022-01-01 00:00:00'), 1.0, 3, 'test', 'Python'],
       [7, Timestamp('2022-01-01 00:00:00'), 1.0, 3, 'train', 'Python'],
       [7, Timestamp('2022-01-01 00:00:00'), 1.0, 3, 'test', 'Python'],
       [7, Timestamp('2022-01-01 00:00:00'), 1.0, 3, 'train', 'Python']],
      dtype=object)

In [104]:
df2.T
#Tranforma linha em coluna e coluna em linha

,0,1,2,3
A,7,7,7,7
B,2022-01-01 00:00:00,2022-01-01 00:00:00,2022-01-01 00:00:00,2022-01-01 00:00:00
C,1.0,1.0,1.0,1.0
D,3,3,3,3
E,test,train,test,train
F,Python,Python,Python,Python

### Concatenando

In [115]:
df = pd.DataFrame({"A": ["A1",'A2','A3'],
                   "B": ["B1",'B2','B3'],
                   'C': ['C1','C2','C3']},
                 index = range(3))
df2 = pd.DataFrame({"A": ["A4",'A5','A6'],
                   "B": ["B4",'B5','B6'],
                   'C': ['C4','C5','C6']},
                 index = [4,5,6])
frames = [df, df2] 
frames

[    A   B   C
 0  A1  B1  C1
 1  A2  B2  C2
 2  A3  B3  C3,
     A   B   C
 4  A4  B4  C4
 5  A5  B5  C5
 6  A6  B6  C6]

In [117]:
concatenado = pd.concat(frames)
concatenado

    A   B   C
0  A1  B1  C1
1  A2  B2  C2
2  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6

In [118]:
#Nem precisa do frames:
concatenado2 = pd.concat([df,df2])
concatenado2

    A   B   C
0  A1  B1  C1
1  A2  B2  C2
2  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6

In [121]:
#Pode colocar chave para mostrar de qual df pertence aqueles dados
concatenado3 = pd.concat([df,df2], keys=["Base 1", "Base 2"])
concatenado3

           A   B   C
Base 1 0  A1  B1  C1
       1  A2  B2  C2
       2  A3  B3  C3
Base 2 4  A4  B4  C4
       5  A5  B5  C5
       6  A6  B6  C6

In [123]:
concatenado3['A']
#Pega tudo da coluna A

Base 1  0    A1
        1    A2
        2    A3
Base 2  4    A4
        5    A5
        6    A6
Name: A, dtype: object

In [127]:
concatenado3.loc['Base 2']

    A   B   C
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6